Repository: elian145/carr
Catalog: lib/l10n/app_*.arb
Languages: ar

# appTitle
source: CARZO
ar: كارزو

# navHome
source: Home
ar: الرئيسية

# navAdd
source: Add
ar: إضافة

# navChat
source: Chat
ar: الدردشة

# navSaved
source: Saved
ar: المحفوظات

# navLogin
source: Login
ar: تسجيل الدخول

# navProfile
source: Profile
ar: الملف الشخصي

# addListingTitle
source: Add Listing
ar: إضافة إعلان

# favoritesTitle
source: Favorites
ar: المفضلة

# chatTitle
source: Chat
ar: الدردشة

# loginTitle
source: Login
ar: تسجيل الدخول

# signupTitle
source: Sign Up
ar: إنشاء حساب

# profileTitle
source: Profile
ar: الملف الشخصي

# paymentHistoryTitle
source: Payment History
ar: سجل الدفعات

# paymentInitiateTitle
source: Payment Initiate
ar: بدء الدفع

# chatConversationTitle
source: Chat Conversation
ar: المحادثة

# paymentStatusTitle
source: Payment Status
ar: حالة الدفع

# editListingTitle
source: Edit Listing
ar: تعديل الإعلان

# brandLabel
source: Brand
ar: العلامة التجارية

source: Any Brand
ar: أي علامة

# modelLabel
source: Model
ar: الموديل

source: Any Model
ar: أي موديل

# yearLabel
source: Year
ar: السنة

source: Any Year
ar: أي سنة

# priceLabel
source: Price
ar: السعر

source: Any Price
ar: أي سعر

# mileageLabel
source: Mileage
ar: المسافة

source: Any Mileage
ar: أي مسافة

# conditionLabel
source: Condition
ar: الحالة

# anyCondition
source: Any
ar: أي

# transmissionLabel
source: Transmission
ar: ناقل الحركة

# fuelTypeLabel
source: Fuel Type
ar: نوع الوقود

# bodyTypeLabel
source: Body Type
ar: نوع الهيكل

# cityLabel
source: City
ar: المدينة

source: Apply Filters
ar: تطبيق الفلاتر

source: Clear Filters
ar: مسح الفلاتر

source: Submit
ar: إرسال

source: OK
ar: حسناً

source: Any
ar: أي

source: Active Filters:
ar: الفلاتر المفعلة:

source: More Filters
ar: فلاتر أخرى

source: Price Range
ar: نطاق السعر

source: Min Price
ar: أدنى سعر

source: Max Price
ar: أقصى سعر

source: Any Min Price
ar: أي أدنى سعر

source: Any Max Price
ar: أي أقصى سعر

source: Year Range
ar: نطاق السنة

source: Min Year
ar: أدنى سنة

source: Max Year
ar: أقصى سنة

source: Any Min Year
ar: أي أدنى سنة

source: Any Max Year
ar: أي أقصى سنة

source: Enter min year
ar: أدخل أدنى سنة

source: Enter max year
ar: أدخل أقصى سنة

source: Mileage Range
ar: نطاق المسافة

source: Min Mileage
ar: أدنى مسافة

source: Max Mileage
ar: أقصى مسافة

source: Enter min mileage
ar: أدخل أدنى مسافة

source: Enter max mileage
ar: أدخل أقصى مسافة

source: Title Status
ar: حالة الملكية

source: Damaged Parts
ar: الأجزاء المتضررة

source: Select Body Type
ar: اختر نوع الهيكل

# colorLabel
source: Color
ar: اللون

source: Select Color
ar: اختر اللون

source: Drive Type
ar: نوع الدفع

source: Cylinder Count
ar: عدد الإسطوانات

source: Seating
ar: المقاعد

source: Engine Size (L)
ar: حجم المحرك (لتر)

source: Sort By
ar: ترتيب حسب

source: Select Brand
ar: اختر العلامة

# tapToSelectBrand
source: Tap to select a brand
ar: اضغط لاختيار علامة

# trimLabel
source: Trim
ar: الفئة

source: Login Required
ar: مطلوب تسجيل الدخول

source: Authentication Required
ar: المصادقة مطلوبة

# requiredField
source: Required
ar: مطلوب

source: Send code first
ar: أرسل الرمز أولاً

source: Resend
ar: إعادة الإرسال

source: Send code
ar: إرسال الرمز

# typeMessage
source: Type a message
ar: اكتب رسالة

source: Error
ar: خطأ

source: Enter phone number
ar: أدخل رقم الهاتف

source: Submit Listing
ar: إرسال الإعلان

# specificationsLabel
source: Specifications
ar: المواصفات

# detail_condition
source: Condition
ar: الحالة

# detail_fuel
source: Fuel
ar: الوقود

# detail_body
source: Body
ar: الهيكل

# detail_color
source: Color
ar: اللون

# detail_drive
source: Drive
ar: الدفع

# detail_cylinders
source: Cylinders
ar: الإسطوانات

# detail_engine
source: Engine
ar: المحرك

# detail_seating
source: Seating
ar: المقاعد

# value_condition_new
source: new
ar: جديد

# value_condition_used
source: used
ar: مستعمل

# value_transmission_automatic
source: automatic
ar: أوتوماتيك

# value_transmission_manual
source: manual
ar: عادي

# value_fuel_gasoline
source: gasoline
ar: بنزين

# value_fuel_diesel
source: diesel
ar: ديزل

# value_fuel_electric
source: electric
ar: كهربائي

# value_fuel_hybrid
source: hybrid
ar: هجين

# value_fuel_lpg
source: LPG
ar: غاز

# value_fuel_plugin_hybrid
source: plug-in hybrid
ar: هجين قابل للشحن

# value_title_clean
source: Clean
ar: نظيف

# value_title_damaged
source: Damaged
ar: متضرر

# value_drive_fwd
source: fwd
ar: أمامي

# value_drive_rwd
source: rwd
ar: خلفي

# value_drive_awd
source: awd
ar: كلي

# value_drive_4wd
source: 4wd
ar: رباعي

# value_body_sedan
source: sedan
ar: سيدان

# value_body_suv
source: suv
ar: دفع رباعي

# value_body_hatchback
source: hatchback
ar: هاتشباك

# value_body_coupe
source: coupe
ar: كوبية

# value_body_pickup
source: pickup
ar: بيك أب

# value_body_van
source: van
ar: فان

# value_body_minivan
source: minivan
ar: ميني فان

# value_body_motorcycle
source: motorcycle
ar: دراجة نارية

# value_body_truck
source: truck
ar: شاحنة

# value_body_cabriolet
source: cabriolet
ar: كابريو

# value_body_roadster
source: roadster
ar: رودستر

# value_body_micro
source: micro
ar: ميكرو

# value_body_cuv
source: cuv
ar: سي يو في

# value_body_wagon
source: wagon
ar: ستيشن

# value_body_minitruck
source: minitruck
ar: ميني شاحنة

# value_body_bigtruck
source: bigtruck
ar: شاحنة كبيرة

# value_body_supercar
source: supercar
ar: سيارة رياضية

# value_body_utv
source: utv
ar: سيارة ترفيهية

# value_body_atv
source: atv
ar: دراجة رباعية

# value_body_scooter
source: scooter
ar: سكوتر

# value_body_super_bike
source: super bike
ar: دراجة رياضية

# unit_km
source: km
ar: كم

# unit_liter_suffix
source: L
ar: لتر

source: Min
ar: أدنى

source: Max
ar: أقصى

# whatsappLabel
source: WhatsApp Number (with country code)
ar: رقم واتساب (مع رمز الدولة)

source: Photos (optional)
ar: الصور (اختياري)

source: Add Photos
ar: إضافة صور

source: Add More Photos
ar: إضافة المزيد من الصور

# defaultSort
source: Default
ar: افتراضي

# sort_price_low_high
source: Price (Low to High)
ar: السعر (تصاعدي)

# sort_price_high_low
source: Price (High to Low)
ar: السعر (تنازلي)

# sort_year_newest
source: Year (Newest)
ar: السنة (الأحدث)

# sort_year_oldest
source: Year (Oldest)
ar: السنة (الأقدم)

# sort_mileage_low_high
source: Mileage (Low to High)
ar: المسافة (تصاعدي)

# sort_mileage_high_low
source: Mileage (High to Low)
ar: المسافة (تنازلي)

# sort_newest
source: Newest
ar: الأحدث

source: No cars found
ar: لا توجد سيارات

source: Car not found
ar: السيارة غير موجودة

source: Chat on WhatsApp
ar: محادثة على واتساب

source: Unable to open WhatsApp
ar: تعذر فتح واتساب

source: Back to list
ar: عودة إلى القائمة

source: QUICK SELL
ar: بيع سريع

source: Vehicle Videos
ar: فيديوهات المركبة

source: Video {index}
ar: فيديو {index}

# settingsTitle
source: Settings
ar: الإعدادات

# settingsEnablePush
source: Enable Push Notifications
ar: تفعيل إشعارات الدفع

# settingsClearCaches
source: Clear Caches
ar: مسح الذاكرة المؤقتة

# settingsCachesSubtitle
source: Home, Details, Favorites, Similar/Related
ar: الرئيسية، التفاصيل، المفضلة، المشابهة/المرتبطة

# settingsCleared
source: Caches cleared
ar: تم مسح الذاكرة المؤقتة

source: Send OTP
ar: إرسال رمز التحقق

# passwordMin8
source: Password must be at least 8 characters
ar: يجب أن تكون كلمة المرور 8 أحرف على الأقل

source: OTP sent
ar: تم إرسال الرمز

# otpFailed
source: Failed to send OTP
ar: فشل إرسال الرمز

# otpFailedWithMsg
source: Failed to send OTP: {msg}
ar: فشل إرسال الرمز: {msg}

source: Dev OTP: {code}
ar: رمز المطور: {code}

source: Arabic
ar: العربية

source: Kurdish
ar: الكردية

# mileageRangeLabel
source: Mileage Range
ar: نطاق المسافة

source: Similar Listings
ar: إعلانات مشابهة

source: Related Listings
ar: إعلانات ذات صلة

# listingUploadPartialFail
source: Listing created, but photo upload failed ({code}).
ar: تم إنشاء الإعلان، لكن فشل رفع الصور ({code}).

# failedToSubmitListing
source: Failed to submit listing: {msg}
ar: فشل إرسال الإعلان: {msg}

# couldNotSubmitListing
source: Could not submit listing. Please try again.
ar: تعذر إرسال الإعلان. حاول مرة أخرى.

# errorTitle
source: Error
ar: خطأ

# okAction
source: OK
ar: حسناً

source: Create account
ar: إنشاء حساب

# haveAccountLogin
source: Have an account? Login
ar: لديك حساب؟ تسجيل الدخول

# notLoggedIn
source: You are not logged in
ar: لست مسجلاً الدخول

# loginAction
source: Log In
ar: تسجيل الدخول

source: Logged in
ar: تم تسجيل الدخول

# usernameLabel
source: Username
ar: اسم المستخدم

# passwordLabel
source: Password
ar: كلمة المرور

# emailLabel
source: Email
ar: البريد الإلكتروني

# phoneLabel
source: Phone
ar: الهاتف

source: Logout
ar: تسجيل الخروج

# devCodeTitle
source: Dev code
ar: رمز المطور

# useCodeToVerify
source: Use this code to verify: {code}
ar: استخدم هذا الرمز للتحقق: {code}

source: Verification code sent
ar: تم إرسال رمز التحقق

source: Save
ar: حفظ

source: Saved
ar: تم الحفظ

source: Select drive type
ar: اختر نوع الدفع

source: Select cylinder count
ar: اختر عدد الإسطوانات

source: Select seating
ar: اختر عدد المقاعد

source: Select engine size
ar: اختر حجم المحرك

source: Select city
ar: اختر المدينة

# enterWhatsAppNumber
source: Enter a WhatsApp number
ar: أدخل رقم واتساب

# useInternationalFormat
source: Use international format e.g. +9647XXXXXXX
ar: استخدم التنسيق الدولي مثال +9647XXXXXXX

# anyOption
source: Any
ar: أي

# city_baghdad
source: Baghdad
ar: بغداد

# city_basra
source: Basra
ar: البصرة

# city_erbil
source: Erbil
ar: أربيل

# city_najaf
source: Najaf
ar: النجف

# city_karbala
source: Karbala
ar: كربلاء

# city_kirkuk
source: Kirkuk
ar: كركوك

# city_mosul
source: Mosul
ar: الموصل

# city_sulaymaniyah
source: Sulaymaniyah
ar: السليمانية

# city_dohuk
source: Dohuk
ar: دهوك

# city_anbar
source: Anbar
ar: الأنبار

# city_halabja
source: Halabja
ar: حلبجة

# city_diyala
source: Diyala
ar: ديالى

# city_diyarbakir
source: Diyarbakir
ar: ديار بكر

# city_maysan
source: Maysan
ar: ميسان

# city_muthanna
source: Muthanna
ar: المثنى

# city_dhi_qar
source: Dhi Qar
ar: ذي قار

# city_salaheldeen
source: Salaheldeen
ar: صلاح الدين

# sellTitle
source: Sell
ar: بيع

# createListingButton
source: Create listing
ar: إنشاء إعلان

source: Creating listing...
ar: جارٍ إنشاء الإعلان...

source: Uploading photos...
ar: جارٍ رفع الصور...

source: Uploading videos...
ar: جارٍ رفع الفيديو...

source: Add photos ({count})
ar: إضافة صور ({count})

source: Add video ({count})
ar: إضافة فيديو ({count})

# pleaseFixHighlightedFields
source: Please fix the highlighted fields
ar: يرجى إصلاح الحقول المحددة

source: Listing created
ar: تم إنشاء الإعلان

# listingTitle
source: Listing
ar: الإعلان

# shareAction
source: Share
ar: مشاركة

# callAction
source: Call
ar: اتصال

# chatAction
source: Chat
ar: دردشة

# favoriteAction
source: Favorite
ar: مفضلة

# favoritesAction
source: Favorites
ar: المفضلة

# editProfileAction
source: Edit profile
ar: تعديل الملف الشخصي

# descriptionTitle
source: Description
ar: الوصف

# retryAction
source: Retry
ar: إعادة المحاولة

source: Seller phone not available
ar: رقم البائع غير متوفر

# couldNotStartCall
source: Could not start a call
ar: تعذر بدء الاتصال

# myListingsTitle
source: My listings
ar: إعلاناتي

# deleteListingTitle
source: Delete listing?
ar: حذف الإعلان؟

# deleteListingBody
source: This will remove it from public listings.
ar: سيتم إزالته من الإعلانات العامة.

# cancelAction
source: Cancel
ar: إلغاء

# deleteAction
source: Delete
ar: حذف

# editAction
source: Edit
ar: تعديل

# comparisonEmptyHint
source: Add cars to comparison from listings.
ar: أضف سيارات للمقارنة من الإعلانات.

# comparisonSpecLabel
source: Spec
ar: المواصفة

# removeAction
source: Remove
ar: إزالة

# settingsThemeTitle
source: Theme
ar: المظهر

# settingsLanguageTitle
source: Language
ar: اللغة

# settingsSystem
source: System
ar: النظام

# settingsLight
source: Light
ar: فاتح

# settingsDark
source: Dark
ar: داكن

# enabledLabel
source: Enabled
ar: مفعل

# disabledLabel
source: Disabled
ar: معطل

# accountLabel
source: Account
ar: الحساب

# apiLabel
source: API
ar: واجهة API

source: No favorites yet
ar: لا توجد مفضلات بعد

# descriptionOptionalLabel
source: Description (optional)
ar: الوصف (اختياري)

# plateBlurNote
source: Note: Plate blurring is enabled by default for privacy.
ar: ملاحظة: طمس اللوحة مفعل افتراضياً للخصوصية.

# invalidField
source: Invalid
ar: غير صالح

# currencyLabel
source: Currency
ar: العملة

# engineTypeLabel
source: Engine type
ar: نوع المحرك

# locationLabel
source: Location
ar: الموقع

# chooseAuthMethodTitle
source: Choose authentication method:
ar: اختر طريقة التسجيل:
